[M_BFFs MissionDefinition]
MissionName="That's great, my friend"
MissionDescription="Four young gangsters argue over who stole the gang's loot. Only one of them tells the truth and the others are lies. You have to find out who the thief is and kill the crawling insects."
TurnInDescription="You have solved a very stressful situation.."
MissionSummary="Find out who stole it."
MissionGiver="Samuel Matthews"
MissionTurnInLocation="Sam Mathew"
TeaserText="Battle of Trujillo!!"

[M_BFFs:MissionStartCollection MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BFFs:QuestionGroupSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BFFs:QuestionJim MissionObjectiveDefinition]
ProgressMessage="Question for Jim"

[M_BFFs:QuestionLindy MissionObjectiveDefinition]
ProgressMessage="Ask Lindy"

[M_BFFs:QuestionOCantler MissionObjectiveDefinition]
ProgressMessage="Ask an accountant"

[M_BFFs:QuestionSam MissionObjectiveDefinition]
ProgressMessage="Three questions"

[M_BFFs:ShootSomeoneDescriptionUpdateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Four small thugs argued about stealing the goods of the gang. Only one speaks the truth. Another lie about stealing and killing thieves <br><br>You interrogate the four robbers, but only one, Lindy, tells the truth, that Sam stole the money. Sam says O'Cantler asked Jim not to steal it. O'Cantler says Sam cheated."

[M_BFFs:ShootThief MissionObjectiveDefinition]
ProgressMessage="Avoid the thieves"

[M_BFFs:ShotCorrectGuySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BFFs:ShotWrongGuySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

